In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = sns.load_dataset('tips')

In [3]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [5]:
type(df['total_bill'].sum())  # [translate:ye find karega ki 'total_bill' column ke sum ka data type kya hai]

numpy.float64

In [6]:
df.isnull()

     total_bill    tip    sex  smoker    day   time   size
0         False  False  False   False  False  False  False
1         False  False  False   False  False  False  False
2         False  False  False   False  False  False  False
3         False  False  False   False  False  False  False
4         False  False  False   False  False  False  False
..          ...    ...    ...     ...    ...    ...    ...
239       False  False  False   False  False  False  False
240       False  False  False   False  False  False  False
241       False  False  False   False  False  False  False
242       False  False  False   False  False  False  False
243       False  False  False   False  False  False  False

[244 rows x 7 columns]

In [7]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

# AGGRIGATION FUNCTION

In [9]:
df['tip']

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [12]:
round(df['tip'].mean())  # Ye code 'tip' column ke average value ko calculate karta hai aur usse nearest integer mein round karta hai

3

In [13]:
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [14]:
round(df['total_bill'].mean())

20

In [15]:
df['time']

0      Dinner
1      Dinner
2      Dinner
3      Dinner
4      Dinner
        ...
239    Dinner
240    Dinner
241    Dinner
242    Dinner
243    Dinner
Name: time, Length: 244, dtype: category
Categories (2, object): ['Lunch', 'Dinner']

In [17]:
# Get unique values from the 'time' column in the dataframe
df['time'].unique()

['Dinner', 'Lunch']
Categories (2, object): ['Lunch', 'Dinner']

In [18]:
df.groupby(['time'], observed=True).sum(['total_bill'])
# [translate:df ka matlab DataFrame hai jisme hum 'time' column ke according data ko group kar rahe hain]
# [translate:observed=True ka matlab hai ki sirf observed categories ko consider karna, agar 'time' categorical hai toh]
# [translate:group karne ke baad har group me 'total_bill' column ke values ka sum calculate karo]

        total_bill     tip  size
time
Lunch      1167.47  185.51   164
Dinner     3660.30  546.07   463

In [21]:
gender = df.groupby('sex',observed=True)

In [22]:
gender

In [23]:
gender.sum(['total_bill'])

        total_bill     tip  size
sex
Male       3256.82  485.07   413
Female     1570.95  246.51   214

In [24]:
gender['total_bill'].sum()

sex
Male      3256.82
Female    1570.95
Name: total_bill, dtype: float64

In [25]:
gender['total_bill'].count()

sex
Male      157
Female     87
Name: total_bill, dtype: int64

In [26]:
gender['total_bill'].sum()/gender['total_bill'].count()

sex
Male      20.744076
Female    18.056897
Name: total_bill, dtype: float64

# MULTI-CATEGORY GROUPING

In [27]:
gt = df.groupby(['sex', 'time'], observed = True)

In [28]:
gt

In [31]:
# Calculate the total sum of the 'total_bill' column in the DataFrame gt
gt['total_bill'].sum()

sex     time
Male    Lunch      595.60
        Dinner    2661.22
Female  Lunch      571.87
        Dinner     999.08
Name: total_bill, dtype: float64

In [33]:
# Calculate the sum of values in the 'total_bill' column for each group in the grouped object 'gt'
gt.sum(['total_bill'])

               total_bill     tip  size
sex    time
Male   Lunch       595.60   95.11    78
       Dinner     2661.22  389.96   335
Female Lunch       571.87   90.40    86
       Dinner      999.08  156.11   128

In [34]:
 dt = df.groupby(['day' , 'time'], observed = True)

In [35]:
dt

In [36]:
dt.sum('total_bill')

             total_bill     tip  size
day  time
Thur Lunch      1077.55  168.83   150
     Dinner       18.78    3.00     2
Fri  Lunch        89.92   16.68    14
     Dinner      235.96   35.28    26
Sat  Dinner     1778.40  260.40   219
Sun  Dinner     1627.16  247.39   216